First/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

First/src/InformationRegisters/Скидки/Скидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Скидки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Скидка</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>НоменклатураНоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

First/src/CommonModules/ЦеныСервер/Module.bsl
Функция ЦенаНаДату(Номенклатура, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Цена;
	КонецЕсли;
	
КонецФункции


Функция СкидкаНаДату(Номенклатура, Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа КАК НоменклатураНоменклатурнаяГруппа,
		|	СкидкиСрезПоследних.Скидка КАК Скидка
		|ИЗ
		|	РегистрСведений.Скидки.СрезПоследних(&Дата, НоменклатураНоменклатурнаяГруппа = &Номенклатура) КАК СкидкиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа КАК НоменклатураНоменклатурнаяГруппа,
			|	СкидкиСрезПоследних.Скидка КАК Скидка
			|ИЗ
			|	РегистрСведений.Скидки.СрезПоследних(
			|			&Дата,
			|			НоменклатураНоменклатурнаяГруппа В
			|				(ВЫБРАТЬ
			|					НоменклатурныеГруппы.Ссылка КАК Наименование
			|				ИЗ
			|					Справочник.Номенклатура КАК Номенклатура
			|						ПОЛНОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
			|						ПО
			|							Номенклатура.НоменклатурнаяГруппа = НоменклатурныеГруппы.Ссылка
			|				ГДЕ
			|					Номенклатура.Ссылка = &Номенклатура)) КАК СкидкиСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Возврат ВыборкаДетальныеЗаписи.Скидка;
		КонецЕсли;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Скидка;
	КонецЕсли;
	
КонецФункции
